coldSunset/STM32L100CWORKBENCH/Core/Src/main.c

#include "stm32l1xx_hal.h"
#include "gpio.h"
#include "stm32l100xc.h"

int flag_toggle =0;

	 //interrupt handler
	 void EXTI0_IRQHandler(void)
	 {
		 //__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_0); //clear this IRQ's_
		HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
		// HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_8);//    _pending status
	 }

	void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
	 {
		 if(GPIO_Pin == GPIO_PIN_0)
		 {
			 flag_toggle = !flag_toggle;
			 while(flag_toggle)
			 {
				 HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_8);
				 for(int i =0 ; i < 1000000 ; i++)
				 {


				 }
			 }
			// HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_8);
		 }
	 }

int main()
{
	 GPIO_InitTypeDef GPIO_InitStruct;

	 HAL_Init();
	 // Important don't forget clock enable!
	 __HAL_RCC_GPIOC_CLK_ENABLE();
	 __HAL_RCC_GPIOA_CLK_ENABLE();

	 //define Blue Led
	 GPIO_InitStruct.Pin = GPIO_PIN_8;
	 GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	 GPIO_InitStruct.Pull = GPIO_NOPULL;
	 GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	 HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	 // define USER BUTTON (B1) = PA0
	 GPIO_InitStruct.Pin = GPIO_PIN_0;
	 GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	 GPIO_InitStruct.Pull = GPIO_PULLDOWN;
	 GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	 HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	 // enable interrupt on EXTI0 line
	 HAL_NVIC_EnableIRQ(EXTI0_IRQn);



	 while(1)
	 {

	 }


	return 0;
}



